#homework 1
# дедлайн 06.04(23:59)
# до того как начать дз советую ознакомиться с материалом выше создать новый проект HomeWork создать файл hero.py и работать внутри него
# 1)создать класс SuperHero с атрибутом класса people='people'
# 2)создать конструктор класса с атрибутами  name,nickname,superpower,health_points, catchphrase.
# 3)добавить метод который выводит имя героя
# 4)добавить метод который умножает здоровье героя на 2
# 5) добавить магический метод который  выводит прозвище героя,его суперспособность и его здоровье
# 6)создать магический метод который считает длину коронной фразы героя
# 7)создать объект класса Hero и вызвать все методы которые вы создали
# 8) создать репозиторий привязать с проектом и запушить его отправить ссылку мне в лс